if OS.mac?
    # taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"

    brew "mas"
    brew "noti"
    brew "trash"

    # Fonts
    cask "font-fira-code"
    cask "font-jetbrains-mono"
    cask "font-cascadia-mono"
    cask "font-3270-nerd-font"
end

tap "homebrew/bundle"
tap "homebrew/core"

# packages
brew "ack"
brew "bat"
brew "cloc"
brew "diff-so-fancy"
brew "exa"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnupg"
brew "grep"
brew "htop"
brew "hub"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "markdown"
brew "neofetch"
brew "tcl-tk" # Required for neovim
brew "neovim"
brew "npm" # Need for coc-vim
brew "python"
brew "ripgrep"
brew "shellcheck"
brew "tmate"
brew "tmux"
brew "tree"
brew "vim"
brew "wdiff"
brew "wget"
brew "z"
brew "zsh"
